trade_exp/src/Documents/ОперацияПоПлатежнойКарте/ОперацияПоПлатежнойКарте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОперацияПоПлатежнойКарте</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КодАвторизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="519f7081-fbb2-4e09-b49f-933cd57fe47b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2bd26061-21f8-477c-a020-950c3ff9e7ec">
    <name>ДеньгиВнесеныCотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a4faab9-0d8e-4f9d-92a2-d5dad0978e3f">
    <name>СотрудникВнесшийДеньги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32212b4a-8193-4934-ba95-d3ed10bd7e8b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ecc4eb3a-88e5-486f-a05e-f6c046cadcf8">
    <name>ДоговорЭквайринга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16dfe378-fa95-4582-8aa7-ded2305d30d3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8034211b-1cf9-4a82-967b-6602bfaae416">
    <name>СуммаКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1e13273-a58d-4cf1-9c0e-0b9661124521">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fef872a-3dcd-4c7f-a523-c3fda7f49b31">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e9692b3-ee83-4533-81cd-7e8c35d1092e">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f39ab37-410a-4b78-a50b-d5c2129ecc65">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc1fbe56-8f5d-46b8-baa2-14741212b2bf">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="855c6534-ffa9-4192-93d5-baabbf4e3f5d">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/ОбъектыРасчетов/ОбъектыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0c588f17-899d-4631-99f3-44aaf039357e">
  <name>ОбъектыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bba798d9-42bd-4341-8275-e5503a1fd11c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d9b52c65-7828-4280-a247-e281ed971ffb">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ОперацияПоПлатежнойКарте/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения1(ДанныеЗаполнения, СтандартнаяОбработка)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОтключитьЗаполнениеОбъектаПоСтатистике",истина);
КонецПроцедуры
	
&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДокументОснование = ДанныеЗаполнения;
	
	// Возврат по динамической ссылке
	ВозвратПоДинамическойСсылке = Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") 	
		И ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту 
		И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ВозвратПоДинамическойСсылке = ИнтеграцияБанки.ПолучитьОплатуДинамическойСсылки(ДанныеЗаполнения.ДокументОснование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВозвратПоДинамическойСсылке) И ВозвратПоДинамическойСсылке.ТребуетсяВозврат Тогда
		
		ЭквайринговыйТерминал 			= ВозвратПоДинамическойСсылке.ЭквайринговыйТерминал;
		СтатьяДвиженияДенежныхСредств 	= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ", Истина);
		СуммаДокумента 					= ВозвратПоДинамическойСсылке.СуммаДокументаВозврата;
		Подразделение 					= ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");

		ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ЭтотОбъект, СуммаДокумента, Ложь);
		ПараметрыПересчетаНДС = Новый Структура("ЦенаВключаетНДС", Истина);
		СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(РасшифровкаПлатежа, СтруктураДействий, Неопределено);
		
		Для Каждого стрРасшифоровки Из РасшифровкаПлатежа Цикл
			стрРасшифоровки.ОснованиеПлатежа = ВозвратПоДинамическойСсылке.ДокументВозврата;
		КонецЦикла;  
	Иначе
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Выручка физ лица пл карта");
		
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
			СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("ВОЗВРАТ ФИЗИЧЕСКОМУ ЛИЦУ(терминал)");
			Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		ЭквайринговыйТерминал = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговыйТерминал();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда 
		ДоговорЭквайринга = ЭквайринговыйТерминал.Владелец; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорЭквайринга) тогда
		Организация = ДоговорЭквайринга.Организация;     
	КонецЕсли;
	СтавкаНДС=УчетНДСУП.СтавкаНДСПоУмолчанию(Организация,ТекущаяДатаСеанса());
	Для Каждого стрРасшифровки Из РасшифровкаПлатежа Цикл
		стрРасшифровки.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		Если Не значениезаполнено(стрРасшифровки.СтавкаНДС) И значениезаполнено(СтавкаНДС) Тогда
			стрРасшифровки.СтавкаНДС=СтавкаНДС;
			стрРасшифровки.СуммаНДС=стрРасшифровки.Сумма-стрРасшифровки.Сумма / (1+СтавкаНДС.ставка / 100);
		КонецЕсли;
	КонецЦикла;  
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РасшифровкаПлатежа.Количество()>0 тогда
		стрРасшифровки= РасшифровкаПлатежа[0];    
		если ЗначениеЗаполнено(стрРасшифровки.ОснованиеПлатежа) тогда
			если стрРасшифровки.ОснованиеПлатежа.Метаданные().Реквизиты.Найти("Организация")<>Неопределено тогда
				если Организация<>стрРасшифровки.ОснованиеПлатежа.Организация тогда
					сообщить("Реквизит Организация в этом документе отличается от этого реквизита в документе-основании");
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;                  
		КонецЕсли;
	КонецЕсли;

	Если РасшифровкаПлатежа.Количество() > 0 Тогда
		стрРасшифровки= РасшифровкаПлатежа[0];
		Если ЗначениеЗаполнено(стрРасшифровки.ОснованиеПлатежа) И ТипЗнч(стрРасшифровки.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Если стрРасшифровки.ОснованиеПлатежа.ССайта Тогда           //ссылка
				Контрагент= стрРасшифровки.ОснованиеПлатежа.Контрагент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДеньгиВнесеныCотрудником = Истина И Не ЗначениеЗаполнено(СотрудникВнесшийДеньги) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите сотрудника, внесшего деньги");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ И Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		Если ЗначениеЗаполнено(ДоговорЭквайринга) и ДоговорЭквайринга.СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей Тогда
			ЭквайринговыйТерминал = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
			
		Иначе
			ЭквайринговыйТерминал = Документы.ОперацияПоПлатежнойКарте.ПолучитьЭквайринговыйТерминал();
			ДоговорЭквайринга = ЭквайринговыйТерминал.Владелец; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПоРеализацииТоваров")
Процедура Док_ЗаполнитьПоРеализацииТоваров(Знач ДокументОснование, ДанныеЗаполнения)
		ОбъектРасчетовТекущий = Неопределено;
		Для Каждого ТекущаяСтрока Из РасшифровкаПлатежа Цикл    
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРасчетов) Тогда
				Если ЗначениеЗаполнено(ДанныеЗаполнения.Договор) Тогда
					ПараметрОбъект = ДанныеЗаполнения.Договор; 
					ТекущееОснование = ДанныеЗаполнения.ДокументОснование;
				Иначе	
					ПараметрОбъект = ДанныеЗаполнения.ДокументОснование.ЗаказКлиента;
					ТекущееОснование = ДанныеЗаполнения.ДокументОснование;
				КонецЕсли;	
				Если ОбъектРасчетовТекущий = Неопределено Тогда    
					ЗапросОбъектРасчетов = Новый Запрос;
					ЗапросОбъектРасчетов.Текст = 
					"ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|ГДЕ
					|	НЕ ОбъектыРасчетов.ПометкаУдаления
					|	И ОбъектыРасчетов.Объект = &ПараметрОбъект";
					
					ЗапросОбъектРасчетов.УстановитьПараметр("ПараметрОбъект", ПараметрОбъект);
					
					РезультатЗапроса = ЗапросОбъектРасчетов.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Если Выборка.Следующий() Тогда 
						ОбъектРасчетовТекущий = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;	   
				ТекущаяСтрока.ОбъектРасчетов = ОбъектРасчетовТекущий; 
				ТекущаяСтрока.ОснованиеПлатежа = ТекущееОснование;
				ТекущаяСтрока.Партнер = ДанныеЗаполнения.Партнер; 
				
			КонецЕсли;	
		КонецЦикла;	
	КонецПроцедуры  

#КонецЕсли
